app/Controllers/Admin/AccommodationController.php

SELECT COUNT(*) AS `numrows` FROM `accommodation`
---
    public function fetch_accommodation() {
        try {
            $db = Database::connect('vantripper_db');
            $builder = $db->table('accommodation');

            $draw   = intval($this->request->getGet('draw'));
            $start  = intval($this->request->getGet('start'));
            $length = intval($this->request->getGet('length'));

            $search = '';
            $search_array = $this->request->getGet('search');
            if (is_array($search_array) && isset($search_array['value'])) {
                $search = $search_array['value'];
            }

            $columns = [
                'id', 'place', 'email', 'contact', 'description', 'remarks', 'fb',
                'hotel_name', 'room_type', 'total_rate', 'per_head', 'capacity',
                'star_rating', 'pet_friendly', 'breakfast', 'pool', 'elevator',
                'function_hall','beachfront', 'distance_from', 'distance_location', 'area',
                'pin_location', 'can_accommodate', 'created_by', 'updated_by'
            ];

            // Total records
            $totalRecords = $builder->countAll();