app/Models/VantripperDB/Departments_Model.php

    public function GetDepartments() {
        return $this->findAll();
---
SELECT *
FROM `departments`