app/Models/VantripperDB/Roles_Model.php

    public function GetRoles() {
        return $this->findALl();
---
SELECT *
FROM `roles`