app/Models/VantripperDB/Users_Model.php

SELECT *
FROM `users`
WHERE `email` = 'dev@gmail.com'
 LIMIT 1
---
    public function GetUsersByEmail($email){
        return $this->where('email', $email)->first();