app/Models/VantripperInvoice/InvoicePackageModel.php

SELECT COUNT(*) AS `numrows` FROM `invoice_package`
---
    public function getTotalRecords(){
        return $this->countAll();

SELECT COUNT(*) AS `numrows`
FROM `invoice_package`
---
    public function getFilteredRecords($searchValue){
        $builder = $this->builder();
        if (!empty($searchValue)) {
            $builder->like('id', $searchValue)
                    ->orLike('sku', $searchValue)
                    ->orLike('category', $searchValue)
                    ->orLike('items', $searchValue)
                    ->orLike('item_full_details', $searchValue)
                    ->orLike('price', $searchValue)
                    ->orLike('quantity', $searchValue);
        }
        return $builder->countAllResults();

SELECT `id`, `sku`, `quantity`, `category`, `items`, `item_full_details`, `price`
FROM `invoice_package`
ORDER BY `id` DESC
 LIMIT 10
---
    public function getData($start, $length, $searchValue, $orderColumn, $orderDir){
        $builder = $this->builder()
                       ->select('id, sku, quantity, category, items, item_full_details, price');

        if (!empty($searchValue)) {
            $builder->like('id', $searchValue)
                    ->orLike('sku', $searchValue)
                    ->orLike('category', $searchValue)
                    ->orLike('items', $searchValue)
                    ->orLike('item_full_details', $searchValue)
                    ->orLike('price', $searchValue)
                    ->orLike('quantity', $searchValue);
        }

        $builder->orderBy($orderColumn, $orderDir)
                ->limit($length, $start);

        return $builder->get()->getResultArray();